{
  "license": "This is a privileged and licensed API for the exclusive use of VMware, Inc. To arrange access to this API for other solutions please contact us at sales@bitnami.com",
  "assets": [
    {
      "partner_id": "confluent",
      "app_id": "confluentplatform",
      "published_at": "2019-08-22T20:35:26.000Z",
      "title": "Confluent Platform Virtual Appliance",
      "version": "5.3.0-0",
      "revision": 0,
      "release_notes": [
        "First release"
      ],
      "type": "ova",
      "topology": "singlevm",
      "endpoint": "vsphere",
      "images": [
        {
          "url": "https://downloads.bitnami.com/files/stacks/confluent-platform/5.3.0-0/bitnami-confluent-platform-5.3.0-0-linux-centos-7-x86_64-nami.ova",
          "sha256": "8bde1c4dafe96627a5d018d13856680ef79c927f563277645d57449fcbd19cf8"
        }
      ],
      "files": null,
      "eula_url": "https://www.confluent.io/EULA/",
      "export_compliance_info": {
        "encryption": {
          "notes": "OpenSource software encryption",
          "proprietary_encryption": false,
          "uses_of_encryption": {
            "user_authentication": true,
            "content_protection": true,
            "securing_communications": true,
            "securing_data_at_rest": true,
            "intended_as_net_infrastructure": true
          }
        },
        "eccn": "5D002 c.1 (b)(1)",
        "hts_number": "N/A",
        "license_exception": "ENC-UR",
        "ccats_file": null
      },
      "required_memory": 12456,
      "default_username": "user",
      "admin_path": null,
      "ports": [],
      "categories": [
        "Hardware",
        "Endpoints"
      ],
      "logo": "https://dyltqmyl993wv.cloudfront.net/assets/stacks/confluent-platform/img/confluent-platform-stack-110x117.png",
      "headline": "This Confluent Platform virtual machine is secure, up-to-date, and pre-configured to work out of the box.",
      "highlights": [
        "Mission-critical reliability - Stream at enterprise scale - Deploy with confidence -  Secure your event streaming platform",
        "Complete event streaming platform - Connect all your apps and data - Process and respond in real-time - Monitor and manage",
        "Freedom of choice - Deploy on any public or private cloud - Stream across on-premises and public clouds - Choose your operational model"
      ],
      "description": "Confluent provides the industry's only enterprise-ready Event Streaming Platform, driving a new paradigm for applications and data infrastructure. With Confluent Platform you can leverage data as continually updating stream of events rather than as discrete snapshots. Over 60% of the Fortune 100 leverage event streaming - and the majority of those leverage Confluent Platform. Confluent provides a single platform for real-time and historical events, enabling you to build and entirely new category of event-driven applications and gain a universal event pipeline. Confluent is founded by the original creators of Apache Kafka (r).\r\n\r\nThis solution has been packaged by Bitnami.\r\n\r\nWhy use Bitnami Apps?\r\n\r\nBitnami certified images are always up-to-date, secure, and built to work right out of the box. \r\n\r\nBitnami packages applications following industry standards and continuously monitors all components and libraries for vulnerabilities and application updates. When any security threat or update is identified, Bitnami automatically repackages the applications and pushes the latest versions to the cloud marketplaces.",
      "screenshots": [
        {
          "id": "default",
          "title": "default",
          "url": "http://bitnami-dev.docker/stack/confluent-platform/default_screenshot"
        }
      ],
      "links": [
        {
          "id": "docs_index",
          "title": "Getting Started",
          "url": "https://docs.bitnami.com/vmware-marketplace/infrastructure/confluent-platform/"
        },
        {
          "id": "documentation",
          "title": "Confluent Platform documentation",
          "url": "https://docs.confluent.io/current/"
        },
        {
          "id": "about_solution",
          "title": "About Confluent Platform Virtual Appliance",
          "url": "https://www.confluent.io"
        },
        {
          "id": "about_bitnami",
          "title": "About Bitnami",
          "url": "https://bitnami.com/application-packaging"
        }
      ],
      "vmc_validated": true,
      "vcd_validated": true,
      "tec_specs": {
        "solution_area": "Public Cloud",
        "os_details": "CentOS",
        "content_type": "Virtual Appliance (OVA)"
      },
      "support": {
        "support_info": "Bitnami provides technical documentation for installation and setup issues through our support center at https://bitnami.com/support/vmware-marketplace",
        "url": "https://www.confluent.io/confluent-cloud/support/"
      },
      "eula_text": "ONLINE SOFTWARE AGREEMENT\nPLEASE READ THIS ONLINE SOFTWARE AGREEMENT BEFORE USING THE CONFLUENT PLATFORM. BY CLICKING ON THE CHECKBOX OR DOWNLOAD BUTTON THAT DEMONSTRATES ACCEPTANCE OF THIS AGREEMENT, OR BY USING THE CONFLUENT PLATFORM, CUSTOMER SIGNIFIES ITS ASSENT TO THIS AGREEMENT. IF YOU ARE ACTING ON BEHALF OF AN ENTITY, THEN YOU REPRESENT THAT YOU HAVE THE AUTHORITY TO ENTER INTO THIS AGREEMENT ON BEHALF OF THAT ENTITY. IF CUSTOMER DOES NOT ACCEPT THE TERMS OF THIS AGREEMENT, THEN IT MUST NOT PURCHASE OR USE THE CONFLUENT PLATFORM.\n\nThis Online Software Agreement ("Agreement") is entered into by and between Confluent, Inc. ("Confluent") and the purchaser or user of the Confluent Platform that accepts the terms of this Agreement ("Customer"). The effective date of this Agreement (the "Effective Date") is the date that Customer uses the Confluent Platform.\n\n1. License.\n\n1.1 License Terms.\n\n1.1 Subject to the terms of this Agreement, Confluent grants to Customer a limited, non-exclusive, non-sublicensable, non-transferable license during the Term of this Agreement to install and use Confluent's proprietary software ("Proprietary Confluent Software") only on servers owned or controlled by Customer and solely for Customer's internal business operations. Confluent also makes available to Customer certain open source software as identified at https://www.confluent.io/third_party_software (the "Third Party Software"). To the extent the terms of open source licenses applicable to Third Party Software prohibit any of the restrictions in this Agreement, such restrictions will not apply to such Third Party Software. To the extent the terms of open source licenses applicable to Third Party Software require Confluent to make an offer to provide source code or related information in connection with the Third Party Software, such offer is made. The Proprietary Confluent Software and the Third Party Software shall be referred to collectively as the "Confluent Platform."\n\n1.2 Additional Restrictions on Use. Customer shall not, and shall not permit or encourage any third party to: (a) use the Proprietary Confluent Software for third-party training, software-as-a-service, time-sharing or service bureau use or (b) disassemble, decompile or reverse engineer any portions of the Proprietary Confluent Software that are not provided in source code format, or otherwise attempt to gain access to the source code to such Proprietary Confluent Software (or the underlying ideas, algorithms, structure or organization of the object code in the Proprietary Confluent Software). The foregoing restriction is inapplicable to the extent prohibited by applicable law; provided that, in the event that Customer intends to disassemble, decompile or reverse engineer such Proprietary Confluent Software, Customer shall first provide Confluent with written notice thereof.\n\n1.3 Copies. Section 1.1 includes the right for Customer to make copies of the Proprietary Confluent Software as necessary to exercise the licenses granted in Section 1.1, and a reasonable number of back-up or archival copies, provided that each such copy shall include Confluent's copyright and any other proprietary notices that appear on the original copies of the Proprietary Confluent Software.\n\n1.4 Confluent Audit Rights. Confluent reserves the right, upon prior notice to Customer, to audit usage of the Proprietary Confluent Software at Customer's premises (and at the premises of or via virtual access to Customer's hosting providers) during normal business hours to verify Customer's compliance with the terms of this Agreement and the applicable usage restrictions set forth on the Reseller Order Form. If Confluent determines as a result of such audit that any fees are due from Customer to Confluent under the terms of this Agreement, Customer shall immediately pay such amounts due along with interest in an amount equal to one and one-half percent (1.5%) of the underpayment per month, or at the highest interest rate permitted by applicable law, whichever is less, calculated monthly from the date the underpayment was due until the date payment is made; and if such amount exceeds five percent (5%) of the cumulative fees previously paid under the applicable Reseller Order Form, Customer shall reimburse Confluent for the reasonable cost of such audit.\n\n1.5 Reservation of Rights. Confluent reserves all rights not expressly granted in this Section. No rights are granted by implication.\n\n1.6 Delivery of Materials. The Confluent Platform, and any versions, updates or maintenance releases of any component thereof, will be delivered only through an electronic transfer. The parties shall reasonably cooperate to effectuate such delivery via FTP or other reasonable means.\n\n2. Payment. Notwithstanding any contrary provision, Customer shall pay Reseller the fees in the amount set forth in the Reseller Order Form (the "Fees") in accordance with the terms set forth therein.\n\n3. Ownership. Customer acknowledges that Confluent or its licensors retain all proprietary rights, title and interest, including all intellectual property rights, in and to the Confluent Platform and any changes, corrections, bug fixes, enhancements, updates and other modifications thereto (collectively, "Modifications") made by or on behalf of Customer, and as between the parties all such rights shall vest in Confluent. Customer acknowledges that the licenses granted in Section 1.1 do not include the right to prepare any Modifications of the Confluent Platform.\n\n4. Confidentiality.\n\n4.1 Nondisclosure. Each party shall retain in confidence the non-public information and know-how disclosed or made available by the other party pursuant to this Agreement which is either designated in writing as proprietary and/or confidential, if disclosed in writing, or if disclosed orally, is designated in writing (which may be via email) as confidential within thirty (30) days of the oral disclosure or should reasonably be understood to be confidential by the recipient (the "Confidential Information"); provided, however that Modifications will be the Confidential Information of Confluent and not Customer. The Proprietary Confluent Software, and the terms and conditions of this Agreement shall be Confluent's Confidential Information regardless of whether marked as such. Each party agrees to: (a) maintain the confidentiality of the other party's Confidential Information; (b) refrain from using the other party's Confidential Information except for the purpose of performing its obligations under this Agreement; and (c) not disclose such Confidential Information to any third party except to employees and subcontractors as is reasonably required in connection with the exercise of its rights and obligations under this Agreement (and only subject to binding written use and disclosure restrictions at least as protective as those set forth herein). Each party shall immediately notify the other party of any unauthorized disclosure or use of any Confidential Information and assist the other party in remedying such unauthorized use or disclosure by taking such steps as are reasonably requested by such other party. The foregoing obligations will not apply to Confidential Information of the other party which is: (i) already publicly known without breach of this Agreement; (ii) discovered or created by the receiving party without use of, or reference to, the Confidential Information of the disclosing party, as shown in records of the receiving party; (iii) otherwise known to the receiving party through no wrongful conduct of the receiving party, or (iv) required to be disclosed by law or court order; provided that the receiving party shall provide prompt notice thereof and reasonable assistance to the disclosing party to enable the disclosing party to seek a protective order or otherwise prevent or restrict such disclosure. Moreover, either party hereto may disclose any Confidential Information hereunder to such party's agents, attorneys and other representatives (and only subject to confidentiality obligations at least as protective as those set forth herein and such party will ensure their compliance therewith) or any court of competent jurisdiction as reasonably required to resolve any dispute between the parties hereto.\n\n4.2 Remedies. Each party acknowledges that any breach or threatened breach of this Section may cause irreparable injury to the disclosing party and that, in addition to any other remedies that may be available, in law, in equity or otherwise, the disclosing party shall be entitled to seek injunctive relief against the threatened breach of this Agreement or the continuation of any such breach by the receiving party, without the necessity of proving actual damages or posting any bond, in addition to any other rights or remedies provided by law.\n\n5. Limited Warranty and Support.\n\n5.1 Scope of Limited Warranty. Confluent warrants to Customer that for a period of thirty (30) days after the first delivery of the Proprietary Confluent Software by Confluent to Customer, the Proprietary Confluent Software, in the form delivered by Confluent to Customer, will perform substantially in accordance with the written documentation therefor. This limited warranty shall not apply if the Proprietary Confluent Software has been: (i) altered or modified; (ii) subjected to negligence, computer or electrical malfunction; or (iii) used, adjusted, installed or operated (A) other than in accordance with this Agreement or the instructions furnished by Confluent or (B) with an application or in an environment other than that intended or recommended by Confluent.\n\n5.2 Exclusive Remedy. Confluent's sole liability and Customer's exclusive remedy under the limited warranty set forth above shall be, at Confluent's election, to attempt, through reasonable efforts and where technically feasible, to correct any failure of the Proprietary Confluent Software to conform to its written documentation or to replace the non-conforming software.  The above remedy is available only if (a) discovery of the non-conformity occurs during the applicable warranty period, (b) Customer notifies Confluent in writing by Customer of such discovery within the warranty period, and (c) Confluent's examination of Proprietary Confluent Software discloses that such non-conformity exists.\n\n5.3 Support and Maintenance. Confluent shall provide the support and maintenance services set forth in the maintenance and support terms, which are posted at [PLEASE PICK THE URL BASED ON THE TIER PURCHASED] Platinum: https://www.confluent.io/maintenance-and-support-services-terms-pla/ Silver: https://www.confluent.io/maintenance-and-support-services-terms-sil/\nGold: https://www.confluent.io/maintenance-and-support-services-terms-gol/\nSupport Services").\n\n5.4 Disclaimer of Any Other Warranties. EXCEPT FOR THE EXPRESS, LIMITED WARRANTY PROVIDED IN THIS SECTION, CONFLUENT MAKES NO WARRANTIES, EXPRESS, IMPLIED, STATUTORY, OR OTHERWISE, WITH RESPECT TO THE CONFLUENT PLATFORM OR ANY OTHER MATERIALS OR SUPPORT SERVICES PROVIDED HEREUNDER. CONFLUENT SPECIFICALLY DISCLAIMS ALL OTHER WARRANTIES, EXPRESS AND IMPLIED, INCLUDING WITHOUT LIMITATION THE IMPLIED WARRANTIES OF MERCHANTABILITY, TITLE, FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NONINFRINGEMENT AND THOSE ARISING FROM A COURSE OF DEALING OR USAGE OR TRADE, AND ALL SUCH WARRANTIES ARE HEREBY EXCLUDED TO THE FULLEST EXTENT PERMITTED BY LAW.  EXCEPT AS EXPRESSLY PROVIDED HEREIN, THE CONFLUENT PLATFORM IS PROVIDED ON AN "AS IS" AND "AS AVAILABLE" BASIS.\n\n6. Infringement Indemnification. Confluent shall defend or at its option settle, at its own expense, any third-party claim, demand or lawsuit brought against Customer to the extent alleging facts that, if true would constitute an infringement by the Proprietary Confluent Software of such third party's intellectual property right, and will pay such damages or costs as are finally awarded against Customer attributable to such action, provided that Customer: (a) notifies Confluent promptly in writing of any such action; (b) gives Confluent sole control of the defense or settlement of such action; and (c) gives Confluent all reasonable information and assistance, at Confluent's expense. Should the Proprietary Confluent Software become, or in the opinion of Confluent be likely to become, the subject of such an infringement claim, Confluent may, at its option: (i) procure for Customer the right to use the Proprietary Confluent Software, as applicable, at no charge to Customer; (ii) replace or modify, in whole or in part, the Proprietary Confluent Software, as applicable, to make it non-infringing; or (iii) accept return of the Proprietary Confluent Software, or remove the allegedly offending module thereof, and, refund a pro rata portion of the Fees paid by Customer to Reseller for the then-current Term. Confluent assumes no liability hereunder for any claim of infringement to the extent based on: (x) use of software other than a current unaltered release of the Confluent Platform, as applicable, as provided by Confluent to Customer; or (y) the combination, operation or use of the Proprietary Confluent Software, with non-Confluent programs or data other than those intended or recommended by Confluent. THIS SECTION SETS FORTH CONFLUENT'S ENTIRE LIABILITY AND OBLIGATION AND CUSTOMER'S SOLE REMEDY FOR ANY CLAIM OF INFRINGEMENT OF ANY INTELLECTUAL PROPERTY RIGHTS.\n\n7. Limitation of Liability. EXCEPT FOR BREACH OF SECTION 1.1 OR 1.2, BREACH OF SECTION 4, AND INDEMNIFICATION OBLIGATIONS:\n\n(A) IN NO EVENT SHALL EITHER PARTY'S LIABILITY ARISING UNDER THIS AGREEMENT EXCEED THE AMOUNT PAID OR PAYABLE BY CUSTOMER TO RESELLER FOR THE APPLICABLE SOFTWARE DURING THE TWELVE (12) MONTHS IMMEDIATELY PRIOR TO THE EVENT GIVING RISE TO SUCH LIABILITY; AND\n\n(B) NEITHER PARTY WILL BE LIABLE TO THE OTHER FOR ANY CONSEQUENTIAL, INCIDENTAL, SPECIAL, INDIRECT, PUNITIVE OR EXEMPLARY DAMAGES, INCLUDING WITHOUT LIMITATION LOST PROFITS, BUSINESS, CONTRACTS, REVENUE, GOODWILL, PRODUCTION, ANTICIPATED SAVINGS, LOSS OF DATA, OR COSTS OF PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES, OR FOR ANY CLAIM OR DEMAND BY ANY OTHER PARTY, HOWEVER CAUSED AND (TO THE FULLEST EXTENT PERMITTED BY LAW) UNDER ANY THEORY OF LIABILITY (INCLUDING NEGLIGENCE) EVEN IF SUCH PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\nTHESE LIMITATIONS SHALL APPLY NOTWITHSTANDING ANY FAILURE OF ESSENTIAL PURPOSE OF ANY LIMITED REMEDY.\n\n8. Term and Termination.\n\n8.1 Term. Unless earlier terminated as provided in this Section, this Agreement and the license granted hereunder shall be effective as of the Effective Date and shall continue thereafter for the period specified in the applicable Reseller Order Form (the "Initial Term"), and shall thereafter automatically renew for additional periods of equal to that of the Initial Term at the pricing specified in the Reseller Order Form unless either party provides written notice of its intention not to renew to the other party and Reseller at least sixty (60) days prior to expiration of the current Term (each a "Renewal Term," and collectively together with the Initial Term, the "Term").\n\n8.2 Termination. Either party shall have the right to terminate this Agreement and the license granted herein upon written notice in the event the other party fails to perform or observe any material term or condition of this Agreement and such default has not been cured no later than thirty (30) days after written notice of such default to the other party. Confluent may also terminate this Agreement immediately if the Customer: (a) terminates or suspends its business; (b) becomes subject to any bankruptcy or insolvency proceeding under Federal or state statute; (c) becomes insolvent or subject to direct control by a trustee, receiver or similar authority; or (d) has wound up or liquidated, voluntarily or otherwise.\n\n8.3 Effect of Termination. The rights and obligations of Confluent and Customer in Sections 1.4 (Audits), 1.5 (Reservation of Rights), 3 (Ownership), 4 (Confidentiality), 5.4 (Disclaimer of Any Other Warranties), 6 (Infringement Indemnification), 7 (Limitation of Liability), 8.3 (Effect of Termination) and 9 (Miscellaneous) shall survive termination of this Agreement.  No later than five (5) days after termination of this Agreement, Customer shall return to Confluent or, upon Confluent's request, destroy or render inaccessible, at Customer's sole expense, all Confidential Information of Confluent and materials containing any Confidential Information of Confluent, and discontinue use of and uninstall the Proprietary Confluent Software, including all copies thereof.  Nothing contained herein shall limit any other remedies that Confluent may have for the default of Customer under this Agreement nor relieve Customer of any of its obligations incurred prior to such termination.\n\n9. Miscellaneous\n\n9.1 Assignment. Customer shall not assign or otherwise transfer this Agreement or any rights or obligations hereunder, in whole or in part, whether by operation of law or otherwise, to any third party without Confluent's prior written consent. Any purported transfer, assignment or delegation without such prior written consent will be null and void and of no force or effect. Notwithstanding the foregoing, Customer shall have the right to assign this Agreement to any successor to its business or assets to which this Agreement relates, whether by merger, sale of assets, sale of stock, reorganization or otherwise, conditioned upon (a) the parties' mutual written agreement on any additional fees payable as a result of such assignment and (b) the payment of such fees. Confluent shall have the right to assign this Agreement to any successor to its business or assets to which this Agreement relates, whether by merger, sale of assets, sale of stock, reorganization or otherwise. Subject to this Section, this Agreement shall be binding upon and inure to the benefit of the parties hereto, and their respective successors and permitted assigns.\n\n9.2 Entire Agreement; Modification; Waiver. This Agreement, together with its exhibits and Reseller Order Forms, represents the entire agreement between the parties, and supersedes all prior agreements and understandings, written or oral, with respect to the matters covered by this Agreement, and is not intended to confer upon any third party any rights or remedies hereunder.  Customer acknowledges that it has not entered in this Agreement based on any representations other than those contained herein.  No modification of or amendment to this Agreement, nor any waiver of any rights under this Agreement, shall be effective unless in writing and signed by both parties.  If there is any conflict between the terms and conditions of this Agreement and the terms and conditions of any Customer purchase order or other document, the terms and conditions of this Agreement shall prevail.  The waiver of one breach or default or any delay in exercising any rights shall not constitute a waiver of any subsequent breach or default.\n\n9.3 Delays. In the event that either party is prevented from performing or is unable to perform any of its obligations under this Agreement due to any Act of God, fire, casualty, flood, earthquake, war, strike, lockout, epidemic, destruction of production facilities, riot, insurrection, material unavailability, or any other cause beyond the reasonable control of the party invoking this Section, and if such party shall have used its commercially reasonable efforts to mitigate its effects, such party shall give prompt written notice to the other party, and the time for the performance shall be extended for the period of delay or inability to perform due to such occurrences.\n\n9.4 Governing Law. This Agreement shall in all respects be governed by the laws of the State of California without reference to its principles of conflicts of laws. The parties hereby agree that all disputes arising out of this Agreement shall be subject to the exclusive jurisdiction of and venue in the federal and state courts within Santa Clara County, California. Customer hereby consents to the personal and exclusive jurisdiction and venue of these courts. The parties hereby disclaim and exclude the application hereto of the United Nations Convention on Contracts for the International Sale of Goods.\n\n9.5 Severability. If any provision of this Agreement is held invalid or unenforceable under applicable law by a court of competent jurisdiction, it shall be replaced with the valid provision that most closely reflects the intent of the parties and the remaining provisions of the Agreement will remain in full force and effect.\n\n9.6 Relationship of the Parties. Nothing in this Agreement is to be construed as creating an agency, partnership, or joint venture relationship between the parties hereto. Neither party shall have any right or authority to assume or create any obligations or to make any representations or warranties on behalf of any other party, whether express or implied, or to bind the other party in any respect whatsoever. Each party may identify the other as a customer or supplier, as applicable.\n\n9.7 Notices. All notices permitted or required under this Agreement shall be in writing and shall be deemed to have been given when delivered in person (including by overnight courier), or three (3) business days after being mailed by first class, registered or certified mail, postage prepaid, to the address of the party specified in the Reseller Order Form or such other address as either party may specify in writing.\n\n9.8 Export Law Assurances.Customer understands that the Proprietary Confluent Software is subject to export control laws and regulations. CUSTOMER MAY NOT DOWNLOAD OR OTHERWISE EXPORT OR RE-EXPORT THE PROPRIETARY CONFLUENT SOFTWARE OR ANY UNDERLYING INFORMATION OR TECHNOLOGY EXCEPT IN FULL COMPLIANCE WITH ALL APPLICABLE LAWS AND REGULATIONS, IN PARTICULAR, BUT WITHOUT LIMITATION, UNITED STATES EXPORT CONTROL LAWS. NONE OF THE PROPRIETARY CONFLUENT SOFTWARE OR ANY UNDERLYING INFORMATION OR TECHNOLOGY MAY BE DOWNLOADED OR OTHERWISE EXPORTED OR RE- EXPORTED: (a) INTO (OR TO A NATIONAL OR RESIDENT OF) ANY COUNTRY TO WHICH THE UNITED STATES HAS EMBARGOED GOODS; OR (b) TO ANYONE ON THE U.S. TREASURY DEPARTMENT'S LIST OF SPECIALLY DESIGNATED NATIONALS OR THE U.S. COMMERCE DEPARTMENT'S LIST OF PROHIBITED COUNTRIES OR DEBARRED OR DENIED PERSONS OR ENTITIES. CUSTOMER HEREBY AGREES TO THE FOREGOING AND REPRESENTS AND WARRANTS THAT CUSTOMER IS NOT LOCATED IN, UNDER CONTROL OF, OR A NATIONAL OR RESIDENT OF ANY SUCH COUNTRY OR ON ANY SUCH LIST.\n\n9.9 Counterparts. This Agreement may be executed in counterparts, each of which shall be deemed an original and all of which together shall constitute one instrument.\n\n9.10 Construction. The titles and section headings used in this Agreement are for ease of reference only and shall not be used in the interpretation or construction of this Agreement. No rule of construction resolving any ambiguity in favor of the non-drafting party shall be applied hereto. The word "including", when used herein, is illustrative rather than exclusive and means "including, without limitation."\n\nv. April 2017",
      "license_type": "byol"
    },
    {
      "partner_id": "gitlab",
      "app_id": "gitlabee",
      "published_at": "2019-09-11T10:35:12.000Z",
      "title": "GitLab EE Virtual Appliance",
      "version": "12.2.5-0",
      "revision": 0,
      "release_notes": [
        "Updated GitLab EE to 12.2.5"
      ],
      "type": "ova",
      "topology": "singlevm",
      "endpoint": "vsphere",
      "images": [
        {
          "url": "https://downloads.bitnami.com/files/stacks/gitlabee/12.2.5-0/bitnami-gitlabee-12.2.5-0-linux-centos-7-x86_64.ova",
          "sha256": "1b671a6888d2aa82159cd863aff28d0b8999a805329cf77c0201b0851e6349d7"
        }
      ],
      "files": null,
      "eula_url": "https://about.gitlab.com/terms/#subscription",
      "export_compliance_info": {
        "encryption": {
          "notes": "OpenSource software encryption",
          "proprietary_encryption": false,
          "uses_of_encryption": {
            "user_authentication": true,
            "content_protection": true,
            "securing_communications": true,
            "securing_data_at_rest": true,
            "intended_as_net_infrastructure": true
          }
        },
        "eccn": "5D002 c.1 (b)(1)",
        "hts_number": "N/A",
        "license_exception": "ENC-UR",
        "ccats_file": null
      },
      "required_memory": 4264,
      "default_username": "root",
      "admin_path": null,
      "ports": [
        "80",
        "443"
      ],
      "categories": [
        "Telco",
        "Mobile"
      ],
      "logo": "https://dyltqmyl993wv.cloudfront.net/assets/stacks/gitlabee/img/gitlabee-stack-110x117.png",
      "headline": "This GitLab EE virtual machine is secure, up-to-date, and pre-configured to work out of the box.",
      "highlights": [
        "VISIBLE - Real time view across the entire lifecycle",
        "EFFICIENT - Collaborate without waiting",
        "GOVERNED - Develop and operate with confidence"
      ],
      "description": "GitLab is a complete DevOps platform. Only GitLab enables Concurrent DevOps, unlocking organizations from the constraints of today's toolchain. GitLab provides unmatched visibility, radical new levels of efficiency and comprehensive governance to significantly compress the time between planning a change and monitoring its effect. This radically improves the speed of business.\r\n\r\nBuilt on Open Source, GitLab Enterprise (CORE) leverages the community contributions of developers and users to continuously deliver new DevOps innovations. More than 100,000 organizations from startups to global enterprise organizations, including Ticketmaster, Jaguar Land Rover, NASDAQ, Dish Network and Comcast trust GitLab to deliver great software at new speeds.\r\n\r\nThis solution has been packaged by Bitnami.\r\n\r\nWhy use Bitnami Apps? \r\n\r\nBitnami certified images are always up-to-date, secure, and built to work right out of the box. \r\n\r\nBitnami packages applications following industry standards and continuously monitors all components and libraries for vulnerabilities and application updates. When any security threat or update is identified, Bitnami automatically repackages the applications and pushes the latest versions to the cloud marketplaces.",
      "screenshots": [
        {
          "id": "default",
          "title": "default",
          "url": "http://bitnami-dev.docker/stack/gitlab-ee/default_screenshot"
        }
      ],
      "links": [
        {
          "id": "docs_index",
          "title": "Getting Started",
          "url": "https://docs.bitnami.com/vmware-marketplace/apps/gitlab-ee/"
        },
        {
          "id": "about_solution",
          "title": "About GitLab EE Virtual Appliance",
          "url": "http://about.gitlab.com/"
        },
        {
          "id": "about_bitnami",
          "title": "About Bitnami",
          "url": "https://bitnami.com/application-packaging"
        }
      ],
      "vmc_validated": true,
      "vcd_validated": true,
      "tec_specs": {
        "solution_area": "Public Cloud",
        "os_details": "CentOS",
        "content_type": "Virtual Appliance (OVA)"
      },
      "support": {
        "support_info": "Bitnami provides technical documentation for installation and setup issues through our support center at https://bitnami.com/support/vmware-marketplace",
        "url": "https://about.gitlab.com/support/"
      },
      "eula_text": "GitLab Subscription Terms\n\nBY CHECKING THE "I ACCEPT\" BOX IN THE PURCHASE FLOW, YOU AND ANY ENTITY THAT YOU REPRESENT ("CUSTOMER") ARE UNCONDITIONALLY CONSENTING TO BE BOUND BY AND ARE BECOMING A PARTY TO THESE GITLAB SUBSCRIPTION TERMS ("AGREEMENT") AS OF THE DATE OF CUSTOMER'S FIRST DOWNLOAD OF THE LICENSED MATERIALS (THE \"EFFECTIVE DATE\"). CUSTOMER'S CONTINUED USE OF THE SOFTWARE OR ANY LICENSED MATERIALS PROVIDED BY GITLAB INC. ("GITLAB") SHALL ALSO CONSTITUTE ASSENT TO THE TERMS OF THIS AGREEMENT. IF CUSTOMER DOES NOT UNCONDITIONALLY AGREE TO ALL OF THE TERMS OF THIS AGREEMENT, CLICK THE \"CANCEL\" BUTTON AND THE DOWNLOAD AND INSTALLATION PROCESS WILL NOT CONTINUE. IF THESE TERMS ARE CONSIDERED AN OFFER, ACCEPTANCE IS EXPRESSLY LIMITED TO THESE TERMS. IF YOU ARE EXECUTING THIS AGREEMENT ON BEHALF OF AN ORGANIZATION, YOU REPRESENT THAT YOU HAVE AUTHORITY TO DO SO.\n\n1. LICENSE AND SUPPORT\n1.1 Subject to the terms and conditions of this Agreement, GitLab hereby grants to Customer and its Affiliates (as defined below) a limited, non-exclusive, non-transferable, non-sublicensable license for Customer's and its Affiliates' employees and contractors to (1) internally (a) use, reproduce, modify, prepare derivative works based upon, and display the code of GitLab Enterprise Edition at the tier level selected by Customer (or set forth on a Quote (as defined below), if applicable with the specifications generally promulgated by GitLab from time to time (the "Software"), excluding Options for the Enterprise Edition unless listed on the Quote, solely (i) for its internal use in connection with the development of Customer's and/or its Affiliates' own software, and (ii) by the number of internal users for which Customer has paid GitLab; and (b) use the documentation, training materials or other materials supplied by GitLab (the "Other GitLab Materials"); and (2) modify the Software and publish patches to the Software, solely by the number of internal users for which Customer has paid GitLab. Notwithstanding anything to the contrary, Customer agrees that GitLab and/or its licensors (as applicable) retain all right, title and interest in and to all Software incorporated in such modifications and/or patches, and all such Software may only be used, copied, modified, displayed, distributed, or otherwise exploited in full compliance with this Agreement, and with a valid GitLab Enterprise Edition subscription for the correct number of User seats. The Software and Other GitLab Materials are collectively referred to herein as the "Licensed Materials." "Affiliate" means any entity(ies) controlling, controlled by, and/or under common control with a party hereto, where "control" means the ownership of more than 50% of the voting securities in such entity. \"User\" means each individual end-user (person or machine) of Customer and/or its Affiliates (including, without limitation, employees, agents or consultants thereof) with access to the Licensed Materials hereunder.\n1.2 Subject to the terms hereof, GitLab will provide reasonable support to Customer for the Licensed Materials as set forth at https://about.gitlab.com/support/#gitlab-support-offerings, for the support plan selected and paid for by Customer. Notwithstanding anything to the contrary, in the event that Customer does not reasonably comply with written specifications or instructions from GitLab's service engineers regarding any support issue or request (including without limitation, failure to make backups of Customer's Licensed Materials) (each, a "Support Issue"), GitLab may terminate its support obligations to Customer with respect to such Support Issue upon fifteen (15) days' written notice if Customer does not cure such noncompliance within the notice period.\n\n1.2.1 GitLab will use reasonable commercial efforts to respond to support questions by phone or email during the next business day at the latest. The number of support questions is not limited.\n\n2. RESTRICTIONS AND RESPONSIBILITIES\n2.1 Except as expressly authorized in Section 1.1, Customer will not, and will not permit any third party to: use the Licensed Materials for any purpose other than as specifically authorized in Section 1, or in such a manner that would enable any unlicensed person to access the Licensed Materials; use the Licensed Materials or any other GitLab software for timesharing or service bureau purposes or for any purpose other than its and its Affiliates' own internal use (including without limitation, sublicensing, distributing, selling, reselling any of the foregoing); except as expressly permitted herein; use the Licensed Materials in connection with any high risk or strict liability activity (including, without limitation, space travel, firefighting, police operations, power plant operation, military operations, rescue operations, hospital and medical operations or the like); use the Licensed Materials or software other than in accordance with this Agreement and in compliance with all applicable laws and regulations (including but not limited to any privacy laws, and laws and regulations concerning intellectual property, consumer and child protection, obscenity or defamation); or use the Licensed Materials in any manner that (1) is harmful, fraudulent, deceptive, threatening, abusive, harassing, tortious, defamatory, vulgar, obscene, or libelous (including without limitation, accessing any computer, computer system, network, software, or data without authorization, breaching the security of another user or system, and/or attempting to circumvent any User authentication or security process), (2) impersonates any person or entity, including without limitation any employee or representative of GitLab, or (3) contains a virus, trojan horse, worm, time bomb, unsolicited bulk, commercial, or "spam" message, or other harmful computer code, file, or program (including without limitation, password guessing programs, decoders, password gatherers, keystroke loggers, cracking tools, packet sniffers, and/or encryption circumvention programs).\n2.2 Customer will cooperate with GitLab in connection with the performance of this Agreement by making available such personnel and information as may be reasonably required, and taking such other actions as GitLab may reasonably request. Customer will also cooperate with GitLab in establishing a password or other procedures for verifying that only designated employees of Customer have access to any administrative functions of the Licensed Materials. Customer shall maintain during the term of this Agreement and through the end of the third year after the date on which the final payment is made under this Agreement, books, records, contracts and accounts relating to the payments due GitLab under this Agreement (collectively, the "Customer Records"). GitLab may, at its sole expense, upon 30 days' prior written notice to Customer and during Customer's normal business hours and subject to industry-standard confidentiality obligations, hire an independent third party auditor to audit the Customer Records only to verify the amounts payable under this Agreement. If an audit reveals underpayment, then Customer shall promptly pay the deficiency to GitLab plus late fees pursuant to Section 5.2. GitLab shall bear the cost of an audit unless the audit reveals underpayment by more than 5% for the audited period, in which case Customer shall promptly pay GitLab for the reasonable costs of the audit.\n2.3 Customer will be responsible for maintaining the security of Customer's account, passwords (including but not limited to administrative and User passwords) and files, and for all uses of Customer account with or without Customer's knowledge or consent.\n\n3. CONFIDENTIALITY\n3.1 Each party (the "Receiving Party") understands that the other party (the "Disclosing Party") has disclosed or may disclose information relating to the Disclosing Party's technology or business (hereinafter referred to as "Proprietary Information" of the Disclosing Party). Without limiting the foregoing, the Licensed Materials are GitLab Proprietary Information.\n3.2 The Receiving Party agrees: (i) not to divulge to any third person any such Proprietary Information, (ii) to give access to such Proprietary Information solely to those employees with a need to have access thereto for purposes of this Agreement, and (iii) to take the same security precautions to protect against disclosure or unauthorized use of such Proprietary Information that the party takes with its own proprietary information, but in no event will a party apply less than reasonable precautions to protect such Proprietary Information. The Disclosing Party agrees that the foregoing will not apply with respect to any information that the Receiving Party can document (a) is or becomes generally available to the public without any action by, or involvement of, the Receiving Party, or (b) was in its possession or known by it prior to receipt from the Disclosing Party, or (c) was rightfully disclosed to it without restriction by a third party, or (d) was independently developed without use of any Proprietary Information of the Disclosing Party. Nothing in this Agreement will prevent the Receiving Party from disclosing Proprietary Information pursuant to any judicial or governmental order, provided that the Receiving Party gives the Disclosing Party reasonable prior notice of such disclosure to contest such order. In any event, GitLab may collect data with respect to and report on the aggregate response rate and other aggregate measures of the Licensed Materials' performance and Customer's usage of the Licensed Materials; provided that GitLab will not identify Customer as the source of any such data without Customer's prior written consent. For the avoidance of doubt, use of a third party to host the data collected shall not be deemed a disclosure.\n3.3 Each party acknowledges and agrees that the other may suffer irreparable damage in the event of a breach of the terms of Sections 1.1, 2.1 or 3.2 of this Agreement and that such party will be entitled to seek injunctive relief (without the necessity of posting a bond) in the event of any such breach.\n3.4 Both parties will have the right to disclose the existence of the relationship between the parties, but not the terms and conditions of this Agreement, unless such disclosure of the Agreement terms is approved in writing by both Parties prior to such disclosure, or is included in a filing required to be made by a party with a governmental authority (provided such party will use reasonable efforts to obtain confidential treatment or a protective order) or is made on a confidential basis as reasonably necessary to potential investors or acquirers.\n\n4. INTELLECTUAL PROPERTY RIGHTS\n4.1 Except as expressly set forth herein, GitLab alone (and its licensors, where applicable) will retain all intellectual property rights relating to the Licensed Materials and any suggestions, ideas, enhancement requests, feedback, code, or other recommendations provided by Customer, its Affiliates or any third party relating to the Licensed Materials, which are hereby assigned to GitLab. This Agreement is not a sale and does not convey to Customer any rights of ownership in or related to the Licensed Materials, or any intellectual property rights.\n4.2 Customer shall not remove, alter or obscure any of GitLab's (or its licensors') copyright notices, proprietary legends, trademark or service mark attributions, patent markings or other indicia of GitLab's (or its licensors') ownership or contribution from the Licensed Materials. Additionally, Customer agrees to reproduce and include GitLab's (and its licensors') proprietary and copyright notices on any copies of the Licensed Materials, or on any portion thereof, including reproduction of the copyright notice. Notwithstanding anything to the contrary herein, certain components of the Licensed Materials, including without limitation, any component of the Licensed Materials distributed by GitLab as part of the GitLab Community Edition, are licensed by third parties pursuant to the terms of certain third party licenses described in such source code annotations.\n4.3 Customer and its licensors shall (and Customer hereby represents and warrants that they do) have and retain all right, title and interest (including, without limitation, sole ownership of) all software, information, content and data provided by or on behalf of Customer or made available or otherwise distributed through use of the Licensed Materials ("Content") and the intellectual property rights with respect to that Content. If GitLab receives any notice or claim that any Content, or Customer's activities hereunder (including without limitation, with respect to any Content), infringes or violates the rights of a third party or any applicable law or regulation (a "Claim"), Customer will indemnify, defend and hold GitLab harmless from all liability, damages, settlements, attorney fees and other costs and expenses in connection with any such Claim, as incurred. The immediately foregoing indemnity obligations are expressly conditioned on GitLab providing Customer with prompt notice of, and reasonable cooperation and sole control over the defense and/or settlement of the applicable Claim. Subject to the foregoing, GitLab may participate in the defense and/or settlement of any applicable Claim with counsel of its choosing at its own expense.\n4.4 GitLab will defend, indemnify and hold Customer harmless from liability and other amounts paid or payable to unaffiliated third parties resulting from (i) the infringement or violation of any intellectual property or proprietary rights by the Licensed Materials or (ii) the violation of applicable law or regulation by GitLab in performance of its obligations hereunder, provided GitLab is promptly notified of any and all threats, claims and proceedings related thereto and given reasonable assistance and the opportunity to assume sole control over defense and settlement thereof. Subject to the foregoing, Customer may participate in the defense and/or settlement of any claim that is indemnifiable by GitLab with counsel of its choosing at its own expense. The foregoing obligations do not apply with respect to portions or components of the Licensed Materials (i) not created by GitLab, (ii) that are modified after delivery by GitLab, (iii) combined with other products, processes or materials where the alleged infringement relates to such combination, (iv) where Customer continues allegedly infringing activity after being notified thereof or after being informed of modifications that would have avoided the alleged infringement, or (v) where Customer's use of the Licensed Materials is not strictly in accordance with this Agreement and all related documentation.\n\n5. PAYMENT OF FEES\n5.1 Unless and until GitLab and Customer have executed a quote document specifically referencing this Agreement with respect to amounts due on account of the Licensed Materials (a "Quote", which is hereby incorporated by reference, if applicable), and unless Customer's subscription to (and payment with respect to) the Licensed Materials has been made on Customer's behalf by a reseller, Customer will pay GitLab the applicable fees as set forth at https://about.gitlab.com/pricing/ (the "Pricing") for the Licensed Materials selected and/or used by Customer (the "Fees") without any right of set-off or deduction. On each anniversary of the Effective Date, GitLab will invoice Customer (or its reseller, if applicable) with respect to any and all additional Customer Users of the Licensed Materials beyond those for whom Customer has pre-paid, as of such date (and for whom the Fees due pursuant to such invoice will be the then-current per-year User fee with respect to the year just ended, and the then current per-year User fee with respect to all subsequent years, unless otherwise agreed in writing by both parties (collectively, a "True-Up")). For Customers that have pre-paid all Fees for multi-year subscriptions for Licensed Materials pursuant to a Quote, on each anniversary of the Effective Date during the term of this Agreement, (i) a new license key will be provided, and (ii) a True-Up will be conducted. All additional Users purchased shall be co-terminated through the end of the original Subscription period.\n\n5.2 All payments will be made in accordance with the payment schedule and the method of payment set forth in the Pricing. If not otherwise specified, (a) GitLab will invoice Customer with respect to Fees up-front, for each term of the Customer's subscription (as applicable), and (b) payments will be due within thirty (30) days of Customer's receipt of correct invoice. Except as expressly set forth in this Agreement, all Fees paid and/or due hereunder (including any prepaid amounts) are non-refundable, including without limitation if this Agreement is terminated in accordance with Section 6 below. If Customer terminates this Agreement pursuant to Section 6.2 within 45 calendar days from receipt of the initial invoice for the Licensed Materials, GitLab will refund all Fees paid hereunder.\n5.3 Any unpaid fees are subject to a finance charge of one percent (1.0%) per month, or the maximum permitted by law, whichever is lower, plus all expenses of collection, including reasonable attorneys' fees. Fees under this Agreement are exclusive of all taxes, including national, state or provincial and local use, sales, value-added, property and similar taxes, if any. Customer agrees to pay such taxes (excluding US taxes based on GitLab's net income) unless Customer has provided GitLab with a valid exemption certificate. In the case of any withholding requirements, Customer will pay any required withholding itself and will not reduce the amount paid to GitLab on account thereof.\n\n6. TERMINATION\n6.1 This Agreement shall continue until terminated in accordance with this Section 6. Either party may terminate this Agreement upon 15 days' written notice to the other party hereto in the event that Customer has no then-current subscription and license key with respect to the Licensed Materials.\n6.2 Customer may terminate this Agreement at any time upon written notice to GitLab. Either party may terminate this Agreement immediately upon 15 days' written notice to the other party in the event of any material breach of this Agreement (including without limitation, any breach of Section 2.2 and/or failure to pay any amounts when due hereunder) by such party where such material breach is not cured during such notice period.\n6.3 Either party may terminate this Agreement, without notice, (i) upon the institution by or against the other party of insolvency, receivership or bankruptcy proceedings (provided such proceedings are not dismissed within one hundred twenty (120) days of such institution), (ii) upon the other party's making an assignment for the benefit of creditors, or (iii) upon the other party's dissolution or ceasing to do business without a successor.\n6.4 Customer's rights to the Licensed Materials, and any licenses granted hereunder, shall terminate upon any termination of this Agreement. In the event that Customer terminates this Agreement pursuant to the second sentence of Section 6.2 above, GitLab will refund to Customer a pro-rated portion of pre-paid Fees for Services not actually received by Customer as of the date of such termination. The following Sections will survive any termination of this Agreement: 2 through 6 (except for Section 4.3), and 8 through 11.\n\n7. WARRANTY; CUSTOMER SOFTWARE SECURITY\nGitLab represents and warrants that (i) it has all rights and licenses necessary for it to perform its obligations hereunder, and (ii) it will not knowingly include, in any GitLab software released to the public and provided to Customer hereunder, any computer code or other computer instructions, devices or techniques, including without limitation those known as disabling devices, trojans, or time bombs, that are intentionally designed to disrupt, disable, harm, infect, defraud, damage, or otherwise impede in any manner, the operation of a network, computer program or computer system or any component thereof, including its security or user data. If, at any time, GitLab fails to comply with the warranty in this Section, Customer may promptly notify GitLab in writing of any such noncompliance. GitLab will, within thirty (30) days of receipt of such written notification, either correct the noncompliance or provide Customer with a plan for correcting the noncompliance. If the noncompliance is not corrected or if a reasonably acceptable plan for correcting them is not established during such period, Customer may terminate this Agreement as its sole and exclusive remedy for such noncompliance.\n\n8. WARRANTY DISCLAIMER\nEXCEPT AS EXPRESSLY STATED HEREIN, THE LICENSED MATERIALS, SOFTWARE AND GITLAB PROPRIETARY INFORMATION AND ANYTHING PROVIDED IN CONNECTION WITH THIS AGREEMENT ARE PROVIDED \"AS-IS,\" WITHOUT ANY WARRANTIES OF ANY KIND. GITLAB AND ITS LICENSORS HEREBY DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING, WITHOUT LIMITATION, ALL IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, AND NON-INFRINGEMENT.\n\n9. LIMITATION OF LIABILITY\nEXCEPT WITH RESPECT TO BREACH(ES) OF SECTION 1.1 AND/OR 2.1, IN NO EVENT WILL EITHER PARTY OR THEIR LICENSORS BE LIABLE FOR ANY INDIRECT, PUNITIVE, INCIDENTAL, SPECIAL, OR CONSEQUENTIAL DAMAGES ARISING OUT OF OR IN ANY WAY CONNECTED WITH THE USE OF THE LICENSED MATERIALS OR ANYTHING PROVIDED IN CONNECTION WITH THIS AGREEMENT, ANY DELAY OR INABILITY TO USE THE LICENSED MATERIALS OR ANYTHING PROVIDED IN CONNECTION WITH THIS AGREEMENT OR OTHERWISE ARISING FROM THIS AGREEMENT, INCLUDING WITHOUT LIMITATION, LOSS OF REVENUE OR ANTICIPATED PROFITS OR LOST BUSINESS OR LOST SALES, WHETHER BASED IN CONTRACT, TORT (INCLUDING NEGLIGENCE), STRICT LIABILITY, OR OTHERWISE, EVEN IF SUCH PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF DAMAGES. EXCEPT WITH RESPECT TO BREACH(ES) OF SECTION 1.1 AND/OR 2.1, THE TOTAL LIABILITY OF EACH PARTY AND ITS LICENSORS, WHETHER BASED IN CONTRACT, TORT (INCLUDING NEGLIGENCE OR STRICT LIABILITY), OR OTHERWISE, WILL NOT EXCEED, IN THE AGGREGATE, THE GREATER OF (i) ONE THOUSAND DOLLARS ($1,000), OR (ii) THE FEES PAID TO GITLAB HEREUNDER IN ONE YEAR PERIOD ENDING ON THE DATE THAT A CLAIM OR DEMAND IS FIRST ASSERTED. THE FOREGOING LIMITATIONS WILL APPLY NOTWITHSTANDING ANY FAILURE OF ESSENTIAL PURPOSE OF ANY LIMITED REMEDY.\n\n10. U.S. GOVERNMENT MATTERS\nNotwithstanding anything else, Customer may not provide to any person or export or re-export or allow the export or re-export of the Licensed Materials or any software or anything related thereto or any direct product thereof (collectively "Controlled Subject Matter"), in violation of any restrictions, laws or regulations of the United States Department of Commerce, the United States Department of Treasury Office of Foreign Assets Control, or any other United States or foreign agency or authority. Without limiting the foregoing Customer acknowledges and agrees that the Controlled Subject Matter will not be used or transferred or otherwise exported or re-exported to countries as to which the United States maintains an embargo (collectively, "Embargoed Countries"), or to or by a national or resident thereof, or any person or entity on the U.S. Department of Treasury's List of Specially Designated Nationals or the U.S. Department of Commerce's Table of Denial Orders (collectively, "Designated Nationals"). The lists of Embargoed Countries and Designated Nationals are subject to change without notice. Use of the Licensed Materials is representation and warranty that the User is not located in, under the control of, or a national or resident of an Embargoed Country or Designated National. The Controlled Subject Matter may use or include encryption technology that is subject to licensing requirements under the U.S. Export Administration Regulations. As defined in FAR section 2.101, any software and documentation provided by GitLab are "commercial items" and according to DFAR section 252.2277014(a)(1) and (5) are deemed to be "commercial computer software" and "commercial computer software documentation." Consistent with DFAR section 227.7202 and FAR section 12.212, any use modification, reproduction, release, performance, display, or disclosure of such commercial software or commercial software documentation by the U.S. Government will be governed solely by the terms of this Agreement and will be prohibited except to the extent expressly permitted by the terms of this Agreement.\n\n11. MISCELLANEOUS\nIf any provision of this Agreement is found to be unenforceable or invalid, that provision will be limited or eliminated to the minimum extent necessary so that this Agreement will otherwise remain in full force and effect and enforceable. This Agreement is not assignable, transferable or sublicensable by either party without the other party's prior written consent, not to be unreasonably withheld or delayed; provided that either party may transfer and/or assign this Agreement to a successor in the event of a sale of all or substantially all of its business or assets to which this Agreement relates. Both parties agree that this Agreement is the complete and exclusive statement of the mutual understanding of the parties and supersedes and cancels all previous written and oral agreements, communications and other understandings relating to the subject matter of this Agreement, and that all waivers and modifications must be in a writing signed or otherwise agreed to by each party, except as otherwise provided herein. No agency, partnership, joint venture, or employment is created as a result of this Agreement and neither party has any authority of any kind to bind the other in any respect whatsoever. In any action or proceeding to enforce rights under this Agreement, the prevailing party will be entitled to recover costs and attorneys' fees. All notices under this Agreement will be in writing and will be deemed to have been duly given when received, if personally delivered; when receipt is electronically confirmed, if transmitted by facsimile or e-mail; and upon receipt, if sent by certified or registered mail (return receipt requested), postage prepaid. GitLab will not be liable for any loss resulting from a cause over which it does not have direct control. This Agreement will be governed by the laws of the State of California, U.S.A. without regard to its conflict of laws provisions. The federal and state courts sitting in San Francisco County, California, U.S.A. will have proper and exclusive jurisdiction and venue with respect to any disputes arising from or related to the subject matter of this Agreement.\n\n12. DATA PRIVACY\nCustomer shall ensure that any and all information or data, including without limitation, personal data, used by Customer in connection with the Agreement ("Customer Data") is collected, processed, transferred and used in full compliance with Applicable Data Protection Laws (as defined below) and that it has all obtained all necessary authorizations and consents from any data subjects to process Customer Data. Customer shall adopt and maintain appropriate organizational, technical and security measures prior to any such collection, processing or transfer in order to protect against unauthorized access to or use of Customer Data. Customer shall immediately inform GitLab upon becoming aware of any breach within the meaning of Applicable Data Protection Law relating to Customer Data (a "Security Incident") and to cooperate with GitLab in any investigation thereof and in the implementation of any measures reasonably required to be taken in response thereto. If required by Applicable Data Protection Laws, the parties will enter into standard contractual clauses under GDPR (as defined below) for the transfer of any Customer Data outside of the European Union. For purposes hereof: (a) "Applicable Data Protection Laws" means any applicable laws, statutes or regulations as may be amended, extended or re-enacted from time to time which relate to personal data including without limitation (i) prior to 25 May 2018, the EU Data Protection Directive 95/46/EC as transposed into EU Member State law; (ii) from and after 25 May 2018, GDPR and any EU Member State laws implementing the GDPR; and (iii) the e-Privacy Directive 2002/58/EC, as amended and as transposed into EU Member State law and any legislation replacing the e-Privacy Directive and (b) "GDPR" means the Regulation (EU) 2016/679 of the European Parliament and of the Counsel of 27 April 2016 on the protection of natural persons with regard to the processing of personal data and on the free movement of such data, and repealing Directive 95/46/EC (General Data Protection Regulation).",
      "license_type": "byol"
    },
    {
      "partner_id": "cloudbees",
      "app_id": "cloudbeesjenkinsdistro",
      "published_at": "2019-09-05T10:35:14.000Z",
      "title": "CloudBees Jenkins Distribution Virtual Appliance",
      "version": "2.176.3-2-0",
      "revision": 1,
      "release_notes": [
        "New revision",
        "Updated cloudbees-jenkins-distro to 2.176.3-2"
      ],
      "type": "ova",
      "topology": "singlevm",
      "endpoint": "vsphere",
      "images": [
        {
          "url": "https://downloads.bitnami.com/files/stacks/cloudbees-jenkins-distro/2.176.3-2-0/bitnami-cloudbees-jenkins-distro-2.176.3-2-0-r01-linux-centos-7-x86_64-nami.ova",
          "sha256": "e0472cee080b3119ba6857060d81a378093ebe3de55ed788dad41d4161f7d35c"
        }
      ],
      "files": null,
      "eula_url": "https://go.cloudbees.com/docs/general/legal/cloudbees-jenkins-distribution-subscription-agreement/",
      "export_compliance_info": {
        "encryption": {
          "notes": "OpenSource software encryption",
          "proprietary_encryption": false,
          "uses_of_encryption": {
            "user_authentication": true,
            "content_protection": true,
            "securing_communications": true,
            "securing_data_at_rest": true,
            "intended_as_net_infrastructure": true
          }
        },
        "eccn": "5D002 c.1 (b)(1)",
        "hts_number": "N/A",
        "license_exception": "ENC-UR",
        "ccats_file": null
      },
      "required_memory": 4264,
      "default_username": "user",
      "admin_path": null,
      "ports": [
        "80",
        "443"
      ],
      "categories": [
        "Storage",
        "Data Migration "
      ],
      "logo": "https://dyltqmyl993wv.cloudfront.net/assets/stacks/cloudbees-jenkins-distro/img/cloudbees-jenkins-distro-stack-110x117.png",
      "headline": "This CloudBees Jenkins Distribution virtual machine is secure, up-to-date, and pre-configured to work out of the box.",
      "highlights": [
        "Easy Setup: Get up and running quickly with no manual intervention needed. Deploy and start building cool applications in the blink of an eye.",
        "Increased Stability: Provide development teams with a highly dependable, secure, Jenkins environment curated from the most recent supported Jenkins release.",
        "Smooth Upgrades: Wave goodbye to failed Jenkins upgrades and say hello to a seamless upgrade experience, verified by CloudBees."
      ],
      "description": "<p>\r\nCloudBees Jenkins Distribution provides development teams with a highly dependable, secure Jenkins environment curated from the most recent supported Jenkins release. The distribution comes with a recommended catalog of tested plugins available through the <a href='https://go.cloudbees.com/docs/cloudbees-documentation/assurance-program/'>CloudBees Assurance Program</a>. Upgrades are now a smooth, seamless experience with the <a href='https://go.cloudbees.com/docs/cloudbees-documentation/assurance-program/'>Beekeeper Upgrade Assistant</a> . The Beekeeper Upgrade Assistant works in parallel with the CloudBees Assurance Program to provide a centralized view of the monitored Jenkins plugins, as well as recommended actions and configuration options. The free <a href='https://go.cloudbees.com/docs/general/legal/cloudbees-jenkins-distribution-jenkinslicenses/'>CloudBees Jenkins Advisor</a> plugin keeps an eye out for potential issues and recommendations and sends you email notifications with suggestions tailored to your installation.\r\n</p>\r\n<p> \r\nThe <a href='https://go.cloudbees.com/docs/general/legal/cloudbees-jenkins-distribution-jenkinslicenses/'>CloudBees Jenkins Distribution License Report</a>  has a list of included plugins. \r\n</p>\r\n<p>\r\nThis CloudBees Jenkins Distribution virtual machine is secure, up-to-date, and pre-configured to work out of the box. This solution is packaged and published by Bitnami for CloudBees.\r\n</p>\r\n<h3><strong>About CloudBees</strong></h3>\r\n<p>\r\nCloudBees is building the world's first end-to-end automated software delivery system; putting companies on the fast track to transforming great ideas into great software and delivering value to their business more quickly.\r\n</p>",
      "screenshots": [
        {
          "id": "default",
          "title": "default",
          "url": "http://bitnami-dev.docker/stack/cloudbees-jenkins-distro/default_screenshot"
        }
      ],
      "links": [
        {
          "id": "docs_index",
          "title": "Getting Started",
          "url": "https://docs.bitnami.com/vmware-marketplace/apps/cloudbees-jenkins-distro/"
        },
        {
          "id": "documentation",
          "title": "CloudBees Jenkins Distribution documentation",
          "url": "https://go.cloudbees.com/"
        },
        {
          "id": "about_solution",
          "title": "About CloudBees Jenkins Distribution Virtual Appliance",
          "url": "https://go.cloudbees.com/docs/general/feature-definitions/cloudbees-jenkins-distribution/"
        },
        {
          "id": "about_organization",
          "title": "About CloudBees",
          "url": "http://cloudbees.com"
        },
        {
          "id": "about_bitnami",
          "title": "About Bitnami",
          "url": "https://bitnami.com/application-packaging"
        }
      ],
      "vmc_validated": true,
      "vcd_validated": true,
      "tec_specs": {
        "solution_area": "Public Cloud",
        "os_details": "CentOS",
        "content_type": "Virtual Appliance (OVA)"
      },
      "support": {
        "support_info": "<p>\nReceive engineer-to-engineer help and guidance from the experts at CloudBees, many of whom are Jenkins committers and <a href=\"https://www.cloudbees.com/jenkins/jenkins-certification\" target=\"_blank\">CloudBees Certified Jenkins Engineers (CCJE)</a>.\n</p>\n<p>\nFor 24 hours a day, 7 days a week support from the Jenkins experts, visit <a href=\"https://www.cloudbees.com/cloudbees-jenkins-support-gcp\" target=\"_blank\">CloudBees Jenkins Support</a>.\n</p>\n<p>\n<a href=\"https://www.cloudbees.com/products/cloudbees-jenkins-distribution\" target=\"_blank\">Learn more</a>\n</p>",
        "email": "support@cloudbees.com",
        "contact_number": "18556224623",
        "url": "https://www.cloudbees.com/cloudbees-jenkins-support-gcp"
      },
      "eula_text": "CloudBees Jenkins Distribution and CloudBees Jenkins X Distribution Subscription Agreement\n\nThis CloudBees Jenkins Distribution Agreement ("Agreement") is between CloudBees and the user ("User") of the CloudBees Jenkins Distribution software and associated documentation ("Distribution Software"). If Customer is located in North America, Central America, or South America, the contracting entity "CloudBees" herein refers to CloudBees, Inc., a Delaware corporation located at 16692 Coastal Highway, Lewes, DE 19958. If Customer is located anywhere else in the world, the contracting entity "CloudBees" herein refers to CloudBees International, SA, a Swiss company located at Rue des Beaux-Arts 8, CH-2000 Neuchtel, Switzerland. BY CLICKING THE "I ACCEPT" BUTTON, DOWNLOADING THE DISTRIBUTION SOFTWARE OR USING THE DISTRIBUTION SOFTWARE, USER ACKNOWLEDGES THAT USER HAS REVIEWED AND ACCEPTED THIS AGREEMENT.\n\nThe Distribution Software comprises (a) Jenkins Long-Term Support ("Jenkins LTS") or Jenkins X, and other Jenkins project components licensed by the Jenkins community identified in the release notes for the Distribution Software version downloaded by the User ("Jenkins Components"); and (b) CloudBees-proprietary plugins or components identified in the release notes for the Distribution Software version downloaded by the User ("Licensed Components"). The release notes for each version of the Distribution Software are available at: https://www.cloudbees.com/r/cloudbeesjenkinsdistribution-releasenotes and https://www.cloudbees.com/r/cloudbeesjenkinsxdistribution-releasenotes.\n\n1) LICENSED COMPONENTS TERMS. The following terms in this Section 1 apply only to the Licensed Components of the Distribution Software:\n\n1.1) License. Subject to the terms of this Agreement, CloudBees grants to User a personal, perpetual, non-exclusive, non-transferable, non-sublicensable, royalty-free, limited, internal license to install the Licensed Components on computers owned or leased by User solely for User's internal business purposes. At ten-year intervals, User will be required to accept a renewal license to the Licensed Components to maintain User's access to, and continue to use, the Licensed Components pursuant to this Agreement.\n\n1.2) License Conditions. Except as otherwise expressly permitted in this Agreement, User shall not, on its own or through any parent, subsidiary, affiliate, agent or other third party: (i) sell, lease, license, distribute, sublicense or otherwise transfer in whole or in part, any of the Licensed Components to a third party; (ii) decompile, disassemble, translate, reverse engineer or otherwise attempt to derive source code from the Licensed Components, in whole or in part, nor will User use any mechanical, electronic or other method to trace, decompile, disassemble, or identify the source code of the Licensed Components or encourage others to do so; (iii) allow access or permit use of the Licensed Components by any unauthorized users; (iv) create, develop, license, acquire, use, or deploy any third party software or services to circumvent, enable, modify or provide access, permissions or rights which violate the technical restrictions of the Licensed Components; (v) modify or create derivative works based upon the Licensed Components; (vi) disclose the results of any benchmark test of the Licensed Components to any third party without CloudBees' prior written approval; or (vii) change any proprietary rights notices which appear in the Licensed Components.\n\n1.3) Ownership of Licensed Components. Notwithstanding anything to the contrary, except for the limited license rights expressly provided in this Agreement, CloudBees has and will retain the sole and exclusive rights, title and interest in and to the Licensed Components (including, without limitation, all patent, copyright, trademark, trade secret and other intellectual property rights) and all copies, modifications and derivative works. User acknowledges that it is obtaining only a limited license right to the Licensed Components and that irrespective of any use of the words "purchase," "sale," or like terms hereunder no ownership rights are being conveyed to User under this Agreement or otherwise.\n\n2) JENKINS COMPONENTS TERMS. The following terms in this Section 2 apply only to the Jenkins Components of the Distribution Software. CloudBees and User both acknowledge and agree that the Jenkins Components of the Distribution Software are not CloudBees' proprietary software, are not owned by CloudBees or licensed by CloudBees to User by this Agreement. The Jenkins Components are provided to User pursuant to the licenses granted to User by contributors of the Jenkins project, which are available at https://www.cloudbees.com/r/cloudbeesjenkinsdistribution-jenkinscomponents and https://www.cloudbees.com/r/cloudbeesjenkinsxdistribution-jenkinsxcomponents.\n\n3) SUPPORT. CloudBees does not provide any support or subscription services for the Distribution Software under this Agreement. User has no rights to any updates, upgrades or extensions or enhancements to the Distribution Software developed by CloudBees, unless User separately purchases CloudBees subscription services.\n\n4) WARRANTY DISCLAIMER. THE DISTRIBUTION SOFTWARE IS PROVIDED "AS IS" AND WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, INCLUDING THE IMPLIED WARRANTIES OF MERCHANTABILITY, NON- INFRINGEMENT, QUIET ENJOYMENT, ACCURACY OF DATA, SYSTEM INTEGRATION, COURSE OF PERFORMANCE AND FITNESS FOR A PARTICULAR PURPOSE, EXCEPT TO THE EXTENT THAT THESE DISCLAIMERS ARE HELD TO BE LEGALLY INVALID. CLOUDBEES DOES NOT GUARANTEE OR WARRANT THAT THE USE OF THE DISTRIBUTION SOFTWARE, OR ANY MATERIALS PROVIDED TO USER BY CLOUDBEES, WILL BE UNINTERRUPTED OR ERROR FREE. WITHOUT LIMITING THE GENERALITY OF THE FOREGOING DISCLAIMER, THE DISTRIBUTION SOFTWARE IS NOT DESIGNED, MANUFACTURED OR INTENDED FOR USE IN THE PLANNING, CONSTRUCTION, MAINTENANCE, CONTROL, OR DIRECT OPERATION OF NUCLEAR FACILITIES, AIRCRAFT NAVIGATION, CONTROL OR COMMUNICATION SYSTEMS, WEAPONS SYSTEMS, OR DIRECT LIFE SUPPORT SYSTEMS. USER ACKNOWLEDGES THAT CLOUDBEES HAS NO RESPONSIBILITY FOR ANY HARDWARE ON WHICH USER INSTALLS OR EVALUATES THE DISTRIBUTION SOFTWARE.\n\n5) LIMITATION OF LIABILITY. IN NO EVENT WILL CLOUDBEES OR ITS LICENSORS BE LIABLE FOR ANY CLAIM BASED UPON A THIRD PARTY CLAIM; ANY INCIDENTAL, CONSEQUENTIAL, SPECIAL, INDIRECT, EXEMPLARY OR PUNITIVE DAMAGES, WHETHER ARISING IN TORT, CONTRACT, OR OTHERWISE; OR FOR ANY DAMAGES ARISING OUT OF OR IN CONNECTION WITH ANY MALFUNCTIONS, DELAYS, LOSS OF DATA, LOST PROFITS, LOST SAVINGS, INTERRUPTION OF SERVICE, LOSS OF BUSINESS OR ANTICIPATORY PROFITS, EVEN IF CLOUDBEES OR ITS LICENSORS HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. CLOUDBEES' AND ITS LICENSORS' AGGREGATE AND CUMULATIVE LIABILITY ARISING OUT OF OR RELATING TO THIS AGREEMENT, REGARDLESS OF THE FORM OF THE CAUSE OF ACTION, WHETHER IN CONTRACT, TORT (INCLUDING WITHOUT LIMITATION NEGLIGENCE), STATUTE OR OTHERWISE WILL BE LIMITED TO DIRECT DAMAGES AND WILL NOT EXCEED FIFTY DOLLARS (US$50.00). THE ALLOCATIONS OF LIABILITY IN THIS SECTION 4 REPRESENT THE AGREED AND BARGAINED FOR UNDERSTANDING OF THE PARTIES, AND THE COMPENSATION OF CLOUDBEES FOR THE DISTRIBUTION SOFTWARE PROVIDED HEREUNDER REFLECTS SUCH ALLOCATIONS. THE FOREGOING LIMITATIONS, EXCLUSIONS AND DISCLAIMERS ARE AN ALLOCATION OF THE RISK BETWEEN THE PARTIES AND WILL APPLY TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, EVEN IF ANY REMEDY FAILS IN ITS ESSENTIAL PURPOSE.\n\n6) TERM AND TERMINATION. The term of this Agreement will begin on the date of acceptance by User and shall continue until User uninstalls the Distribution Software unless earlier terminated by CloudBees. CloudBees may terminate this Agreement immediately upon User's material breach of the terms of this Agreement. Upon termination or expiration of this Agreement, User will uninstall and destroy the Licensed Components, or return the Licensed Components to CloudBees and certify to CloudBees in writing that all copies or partial copies thereof have been deleted from every computer library and storage device under User's control, are no longer in use by or on behalf of User, and have been either returned to CloudBees or destroyed. Termination will not affect any claim, liability or right arising prior to termination. All rights and obligations granted under Sections 1, 2, 4, 5, and 7 of this Agreement will survive the expiration or termination of this Agreement.\n\n7) GENERAL.\n\n7.1) Independent Parties. Neither User nor CloudBees is a legal representative, partner or agent of the other.\n\n7.2) Entirety. This Agreement represents the entire agreement of the parties with regard to the Distribution Software and supersedes all other agreements related to this subject matter. Delivery of an executed counterpart of this Agreement by facsimile or any other reliable means shall be deemed to be as effective for all purposes as delivery of the manually executed counterpart. This Agreement may not be amended except in writing signed by both parties.\n\n7.3) Severability. If any provision of this Agreement is held invalid or unenforceable for any reason but would be valid and enforceable if appropriately modified, then such provision will apply with the modification necessary to make it valid and enforceable. If such provision cannot be so modified, the parties agree that such invalidity will not affect the validity of the remaining provisions of the Agreement.\n\n7.4) Governing Law and Jurisdiction. This Agreement will be governed by and construed in accordance with the laws of the State of New York without reference to its conflict of laws principles. All disputes arising out of or relating to this Agreement will be submitted to the exclusive jurisdiction of the state or federal courts located in New York, New York, and each party irrevocably consents to such personal jurisdiction and waives all objections to this venue. The parties agree that neither the United Nations Convention on Contracts for the International Sale of Goods nor the Uniform Computer Information Transactions Act (UCITA) will apply in any respect to this Agreement.\n\n7.5) Notices. All notices must be in writing and shall be effective three (3) days after the date sent to the other party's headquarters, Attention Legal Department.",
      "license_type": "free"
    }
  ]
}
